#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ce674b58c497dee8]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/common-eks/cluster]
module.eks.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Read complete after 0s [id=819195744]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
aws_iam_role.aws_ebs_csi_driver_assume_role: Refreshing state... [id=AmazonEBSCSIDriverRole]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001]
data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-20241226043235471900000002]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::183631350996:assumed-role/IaC-ReadOnly/GitHubActions]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001-20241226053858433500000002]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001-20241226053858451400000003]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001-20241226053858526400000004]
aws_iam_role_policy_attachment.test-attach: Refreshing state... [id=AmazonEBSCSIDriverRole-20241226043236301000000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236265200000006]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236260500000005]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236249400000004]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3557718324]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=02e10580-78ff-4a65-be74-445b1cf24ce2]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/common-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-ClusterEncryption20241226043257827400000010]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043258306500000011]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cb890f09324d2b37]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0067559a5263fe9ac]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06b3841968e507322]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0fcb83086061aa8e3]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bca477b56b1140b5]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-00ecb231aa6794c77]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cadcda90cbdf4cfd]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08aab78b96bd0a4c5]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ef9476176f5c8ff1]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0491d2e797e744cc1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d17e8f8b96365daf]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f2278c72fcc298ec]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b02077f46ea8729a]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-041156176234b4197]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-015bc539454911e9c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-095a0b1384b760a3b]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e6ee82ecf20c3185]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09b88f1672e964b49]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08aab78b96bd0a4c51080289494]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1843017391]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3029881194]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-844468187]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3493421729]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2517249076]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-686673597]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-19993364]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-685174604]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2814668107]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1854278365]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1205543513]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03a48fdf594dc4cd2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bfb21ab27774bb3c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c4389e3eadf2a29e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0097f88b5c6785e33]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d17e8f8b96365daf1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=common-eks]
module.eks.aws_eks_access_entry.this["root_user"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:root]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/647A0EE066A5603AB6D3A73F267FCF1C]
module.eks.aws_eks_access_entry.this["github_action_ci"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-26T04:44:58Z]
module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=5802554092292871677]
module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-069dd07b3dda44f56]
module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=common-eks:default-20241226053904092100000007]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=common-eks:kube-proxy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=common-eks:coredns]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=common-eks:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=common-eks:aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=common-eks:vpc-cni]
module.eks.aws_eks_access_policy_association.this["root_user_root_user"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["github_action_ci_github_action_ci"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
data.aws_eks_cluster.eks: Reading...
data.aws_eks_cluster.eks: Read complete after 0s [id=common-eks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server/metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.12.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.strimzi_kafka_operator will be created
  + resource "helm_release" "strimzi_kafka_operator" {
      + atomic                     = false
      + chart                      = "strimzi-kafka-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "strimzi-operator"
      + namespace                  = "strimzi-operator"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://quay.io/strimzi-helm/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.45.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "eks-pod-identity-agent"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/647A0EE066A5603AB6D3A73F267FCF1C"
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.37.0-eksbuild.1" -> (known after apply)
        id                          = "common-eks:aws-ebs-csi-driver"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.11.3-eksbuild.1" -> (known after apply)
        id                          = "common-eks:coredns"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.3.4-eksbuild.1" -> (known after apply)
        id                          = "common-eks:eks-pod-identity-agent"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.31.2-eksbuild.3" -> (known after apply)
        id                          = "common-eks:kube-proxy"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.19.0-eksbuild.1" -> (known after apply)
        id                          = "common-eks:vpc-cni"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "common-eks"
        name                          = "common-eks"
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = [
              - "103.101.111.206/32",
              + "0.0.0.0/0",
            ]
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/647A0EE066A5603AB6D3A73F267FCF1C"
        tags            = {
            "Name" = "common-eks-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "02e10580-78ff-4a65-be74-445b1cf24ce2"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:role/common-eks-cluster-20241226043235471800000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @yashrajdighe, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-plan`*